import numpy as np
import os
os.system('cls')
# задача 1. Задайте натуральное число N.
# Напишите программу, которая составит список простых множителей числа N.

# num = int(input("Введите число: "))
# def primes(x):
#     i = 2
#     array = []
#     while i <= x:
#         if x % i == 0:
#             array.append(i)
#             x //= i
#             i = 2
#         else:
#             i += 1
#     return array
# print(primes(num))

# задача 2 . Задайте последовательность чисел.
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

# array = np.random.randint(0, 10, 10)
# print(f'Исходный массив: {array}')


# def getUniqueNum(arr):
#     newArray = []
#     for i in arr:
#         if i not in newArray:
#             newArray.append(i)
#     return newArray


# print(getUniqueNum(array))
