import os
os.system('cls')
# задача 1. Задайте натуральное число N.
# Напишите программу, которая составит список простых множителей числа N.

# num = int(input("Введите число: "))
# def primes(x):
#     i = 2
#     array = []
#     while i <= x:
#         if x % i == 0:
#             array.append(i)
#             x //= i
#             i = 2
#         else:
#             i += 1
#     return array
# print(primes(num))
